# Lecture 24 2018-11-08: Matplotlib

Joining and merging dataframes; clustering analysis by column values.

all about indexing and using indexes.

In [1]:
import pandas as pd
from pandas import Series, DataFrame   # use these so often, this can be helpful

In [2]:
from matplotlib import pyplot as plt
%matplotlib inline

In [3]:
import numpy as np
from numpy.random import randn

## Multi-indexing

DataFrames can have more than one index, with different index levels having values grouped by the higher level indexes. This gives a "hierarchical" organization for dataframes.

### Create data for examples

In [4]:
test_df = DataFrame( 
    [  
        ['w1','d1',1,10],
            ['w1','d3',2,20],
            ['w2','d1',3,30],
            ['w2','d2',4,40],
            ['w2','d3',5,60],
        ], 
    columns=['week','day','v1','v2'],
    )

test_df['mean'] = test_df[['v1','v2']].mean( axis=1 )
test_df['std'] = test_df[['v1','v2']].std( axis=1 )

test_df

  week day  v1  v2  mean        std
0   w1  d1   1  10   5.5   6.363961
1   w1  d3   2  20  11.0  12.727922
2   w2  d1   3  30  16.5  19.091883
3   w2  d2   4  40  22.0  25.455844
4   w2  d3   5  60  32.5  38.890873

#### creating indexes (from columns)

To set indexes, use the *set_index(l)* method, where *l* is a python list of column names to use as indexes. This converts the columns into multi-level indexes, with the level of the index corresponding to the order of the entries in *l*.

In [5]:
test_df.set_index( [ 'week', 'day' ], inplace=True )
test_df

          v1  v2  mean        std
week day
w1   d1    1  10   5.5   6.363961
     d3    2  20  11.0  12.727922
w2   d1    3  30  16.5  19.091883
     d2    4  40  22.0  25.455844
     d3    5  60  32.5  38.890873

Indexes have multiple *levels*, which are the layers of embedding in the hierarchy. The example below has two levels, one for the values in the weeks index, and one for the values in the day index. This is where *levels=* in examples above comes from.

Indexes can have *names*, which are names for that level in the index. Below, the levels are 'week' at level 0 (the outermost level) and 'day' at level 1 (the innermost). 

Indexes also have *labels*, which are python list indexes into the values for index levels. They identify which group of values are associated with each entry. 

Each of these properties are stored as lists in the *dataframe.index* object.

In [6]:
test_df.index
#test_df.columns

MultiIndex(levels=[[u'w1', u'w2'], [u'd1', u'd2', u'd3']],
           labels=[[0, 0, 1, 1, 1], [0, 2, 0, 1, 2]],
           names=[u'week', u'day'])

#### Removing indexes, and re-indexing

Note that once a column has been converted to an index, it is no longer a column. So,
>df.set_index('d1')

followed by

>df.set_index('d2')

will delete the 'd1' column data entirely from *df*!

To convert an index level back into a column, use *reset_index(l)*, where *l* is a list of index names to convert back into columns.

So, to change indexes, first *reset_index* to remove the old one, then *set_index* to set the new one.

In [7]:
test_df.reset_index(inplace=True)
test_df

  week day  v1  v2  mean        std
0   w1  d1   1  10   5.5   6.363961
1   w1  d3   2  20  11.0  12.727922
2   w2  d1   3  30  16.5  19.091883
3   w2  d2   4  40  22.0  25.455844
4   w2  d3   5  60  32.5  38.890873

In [8]:
test_df.set_index('week', inplace=True)
test_df

     day  v1  v2  mean        std
week
w1    d1   1  10   5.5   6.363961
w1    d3   2  20  11.0  12.727922
w2    d1   3  30  16.5  19.091883
w2    d2   4  40  22.0  25.455844
w2    d3   5  60  32.5  38.890873

In [9]:
test_df.reset_index(inplace=True)
test_df.set_index(['week','day'], inplace=True)
test_df

          v1  v2  mean        std
week day
w1   d1    1  10   5.5   6.363961
     d3    2  20  11.0  12.727922
w2   d1    3  30  16.5  19.091883
     d2    4  40  22.0  25.455844
     d3    5  60  32.5  38.890873

### Accessing Multi-Indexed Series ###

One accesses entries in multi-level indexes with a syntax very similar to indexing in numpy's ndarray objects.

These return a pandas DataFrame or Series, as appropriate.

In [10]:
test_df_mean=test_df['mean']
test_df_mean   # keeping this for next two examples

week  day
w1    d1      5.5
      d3     11.0
w2    d1     16.5
      d2     22.0
      d3     32.5
Name: mean, dtype: float64

In [11]:
print(test_df_mean['w2'] )          # select by first index

day
d1    16.5
d2    22.0
d3    32.5
Name: mean, dtype: float64

In [14]:
test_df_mean[:,'d1']       # select by second index

week
w1     5.5
w2    16.5
Name: mean, dtype: float64

### Computing values in dataframes by level

There are several "aggregating" functions that convert a collection of values into a single value. For example, *mean(d)* computes the (single) average of the valued in *d*. Similarly for *std()*, *sum()*, etc.

One can compute an aggregating function on specific levels in a dataframe by specifying which level(s) to use, with the *level=* parameter of the aggregating function.

*this can be very useful*

In [435]:
test_df

          v1  v2  mean        std
week day
w1   d1    1  10   5.5   6.363961
     d3    2  20  11.0  12.727922
w2   d1    3  30  16.5  19.091883
     d2    4  40  22.0  25.455844
     d3    5  60  32.5  38.890873

In [436]:
# compute means of samples in each week
test_df.mean(level='week')          # or compute mean directly on the right level

       v1         v2       mean        std
week
w1    1.5  15.000000   8.250000   9.545942
w2    4.0  43.333333  23.666667  27.812867

In [437]:
test_df.mean(level='day')

      v1    v2   mean        std
day
d1   2.0  20.0  11.00  12.727922
d3   3.5  40.0  21.75  25.809398
d2   4.0  40.0  22.00  25.455844

In [438]:
test_df.mean(level='day').describe()

             v1         v2       mean        std
count  3.000000   3.000000   3.000000   3.000000
mean   3.166667  33.333333  18.250000  21.331055
std    1.040833  11.547005   6.279928   7.452628
min    2.000000  20.000000  11.000000  12.727922
25%    2.750000  30.000000  16.375000  19.091883
50%    3.500000  40.000000  21.750000  25.455844
75%    3.750000  40.000000  21.875000  25.632621
max    4.000000  40.000000  22.000000  25.809398

### A less silly example

#### Get example data

In [491]:
# To only read certain columns, use *usecols*
x = pd.read_table('milk_summary.txt', 
                  comment='#', 
                  usecols=['sample_id', 'gc_content', 'country', 'gene_id'],
                  index_col='country'
                 )

x.head(n=7)

        sample_id  gc_content gene_id
country
PE          PE716    0.287770     ST6
PE          PE714    0.384342     ST6
ETU        ETU011    0.395683     ST6
ETR        ETR208    0.315412     ST6
PE          PE731    0.380783     ST6
GBR        GBR320    0.590747    FUT3
SW          SW903    0.366906     ST6

#### Get mean gc content by country

In [440]:
mean_by_country = x.mean(level='country')
mean_by_country

         gc_content
country
PE         0.450601
ETU        0.451564
ETR        0.445550
GBR        0.457919
SW         0.464215
SP         0.442890
GN         0.468612
USW        0.450324
KE         0.457715
GBU        0.457202

#### Get mean gc content by gene

In [441]:
x.reset_index(inplace=True)         # put the country index back as a column
x.head()

  country sample_id  gc_content gene_id
0      PE     PE716    0.287770     ST6
1      PE     PE714    0.384342     ST6
2     ETU    ETU011    0.395683     ST6
3     ETR    ETR208    0.315412     ST6
4      PE     PE731    0.380783     ST6

In [442]:
x.set_index('gene_id', inplace=True)
x.head()

        country sample_id  gc_content
gene_id
ST6          PE     PE716    0.287770
ST6          PE     PE714    0.384342
ST6         ETU    ETU011    0.395683
ST6         ETR    ETR208    0.315412
ST6          PE     PE731    0.380783

In [443]:
mean_by_gene = x.mean(level='gene_id')
mean_by_country

         gc_content
country
PE         0.450601
ETU        0.451564
ETR        0.445550
GBR        0.457919
SW         0.464215
SP         0.442890
GN         0.468612
USW        0.450324
KE         0.457715
GBU        0.457202

#### get gc content for both country and gene_id, using multi-indexing

In [444]:
x.reset_index(inplace=True)         # put the country index back as a column
x.set_index(['country','gene_id'], inplace=True)
x.head()

                sample_id  gc_content
country gene_id
PE      ST6         PE716    0.287770
        ST6         PE714    0.384342
ETU     ST6        ETU011    0.395683
ETR     ST6        ETR208    0.315412
PE      ST6         PE731    0.380783

In [445]:
mean_by_country = x.mean(level='country')
mean_by_country

         gc_content
country
PE         0.450601
ETU        0.451564
ETR        0.445550
GBR        0.457919
SW         0.464215
SP         0.442890
GN         0.468612
USW        0.450324
KE         0.457715
GBU        0.457202

In [446]:
mean_by_gene = x.mean(level='gene_id')
mean_by_gene

         gc_content
gene_id
ST6        0.394396
FUT3       0.621272
GULOP      0.500397
FUT2       0.531883
SEC        0.563558

## Reshaping DataFrames

DataFrame methods for multi-level indexes

method | meaning
:----- | :--------
stack  | add extra indexs and index levels to convert to a 1D Series ("flattens") with lotss of indexes
unstack| adds as many index levels as necessary *to columns names* to remove all hierarchies ("widens")

(we didn't do examples of multi-indexing in the columns)

use these to reshape dataframes.

In [447]:
test_df = DataFrame( 
    [  
        ['w1','d1',1,10],
            ['w1','d3',2,20],
            ['w2','d1',3,30],
            ['w2','d2',4,40],
            ['w2','d3',5,60],
        ], 
    columns=['week','day','v1','v2']
    )

test_df['mean'] = test_df[['v1','v2']].mean( axis=1 )
test_df['std'] = test_df[['v1','v2']].std( axis=1 )
test_df.set_index( [ 'week', 'day' ], inplace=True )

### pd.stack()

flattens dataframes into 1D pd.Series

In [448]:
test_df

          v1  v2  mean        std
week day
w1   d1    1  10   5.5   6.363961
     d3    2  20  11.0  12.727922
w2   d1    3  30  16.5  19.091883
     d2    4  40  22.0  25.455844
     d3    5  60  32.5  38.890873

In [449]:
tDFs = test_df.stack()        # returns a pd.Series
#type(tDFs)
tDFs

week  day
w1    d1   v1       1.000000
           v2      10.000000
           mean     5.500000
           std      6.363961
      d3   v1       2.000000
           v2      20.000000
           mean    11.000000
           std     12.727922
w2    d1   v1       3.000000
           v2      30.000000
           mean    16.500000
           std     19.091883
      d2   v1       4.000000
           v2      40.000000
           mean    22.000000
           std     25.455844
      d3   v1       5.000000
           v2      60.000000
           mean    32.500000
           std     38.890873
dtype: float64

In [450]:
tDFs.index

MultiIndex(levels=[['w1', 'w2'], ['d1', 'd2', 'd3'], ['v1', 'v2', 'mean', 'std']],
           labels=[[0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]],
           names=['week', 'day', None])

In [492]:
tDFs['w2']

day
d1   v1       3.000000
     v2      30.000000
     mean    16.500000
     std     19.091883
d2   v1       4.000000
     v2      40.000000
     mean    22.000000
     std     25.455844
d3   v1       5.000000
     v2      60.000000
     mean    32.500000
     std     38.890873
dtype: float64

In [493]:
tDFs[:,'d3']

week
w1    v1       2.000000
      v2      20.000000
      mean    11.000000
      std     12.727922
w2    v1       5.000000
      v2      60.000000
      mean    32.500000
      std     38.890873
dtype: float64

### pd.unstack()

"widens" dataframe by spreading all but the first index across rows, addings lots of redundancy

In [452]:
test_df

          v1  v2  mean        std
week day
w1   d1    1  10   5.5   6.363961
     d3    2  20  11.0  12.727922
w2   d1    3  30  16.5  19.091883
     d2    4  40  22.0  25.455844
     d3    5  60  32.5  38.890873

In [453]:
tDFus = test_df.unstack()
type(tDFus)
tDFus

       v1              v2              mean                    std             \
day    d1   d2   d3    d1    d2    d3    d1    d2    d3         d1         d2
week
w1    1.0  NaN  2.0  10.0   NaN  20.0   5.5   NaN  11.0   6.363961        NaN
w2    3.0  4.0  5.0  30.0  40.0  60.0  16.5  22.0  32.5  19.091883  25.455844


day          d3
week
w1    12.727922
w2    38.890873

In [494]:
# to completely flatten
test_df.unstack().unstack()

      day  week
v1    d1   w1       1.000000
           w2       3.000000
      d2   w1            NaN
           w2       4.000000
      d3   w1       2.000000
           w2       5.000000
v2    d1   w1      10.000000
           w2      30.000000
      d2   w1            NaN
           w2      40.000000
      d3   w1      20.000000
           w2      60.000000
mean  d1   w1       5.500000
           w2      16.500000
      d2   w1            NaN
           w2      22.000000
      d3   w1      11.000000
           w2      32.500000
std   d1   w1       6.363961
           w2      19.091883
      d2   w1            NaN
           w2      25.455844
      d3   w1      12.727922
           w2      38.890873
dtype: float64

In [495]:
tDFus.columns

MultiIndex(levels=[['v1', 'v2', 'mean', 'std'], ['d1', 'd2', 'd3']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2]],
           names=[None, 'day'])

can unstack into new multi-indexes

In [456]:
tDFs.index

MultiIndex(levels=[['w1', 'w2'], ['d1', 'd2', 'd3'], ['v1', 'v2', 'mean', 'std']],
           labels=[[0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1], [0, 0, 0, 0, 2, 2, 2, 2, 0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]],
           names=['week', 'day', None])

In [457]:
tDFs

week  day
w1    d1   v1       1.000000
           v2      10.000000
           mean     5.500000
           std      6.363961
      d3   v1       2.000000
           v2      20.000000
           mean    11.000000
           std     12.727922
w2    d1   v1       3.000000
           v2      30.000000
           mean    16.500000
           std     19.091883
      d2   v1       4.000000
           v2      40.000000
           mean    22.000000
           std     25.455844
      d3   v1       5.000000
           v2      60.000000
           mean    32.500000
           std     38.890873
dtype: float64

In [458]:
tDFs.unstack(level='week')

week             w1         w2
day
d1  v1     1.000000   3.000000
    v2    10.000000  30.000000
    mean   5.500000  16.500000
    std    6.363961  19.091883
d2  v1          NaN   4.000000
    v2          NaN  40.000000
    mean        NaN  22.000000
    std         NaN  25.455844
d3  v1     2.000000   5.000000
    v2    20.000000  60.000000
    mean  11.000000  32.500000
    std   12.727922  38.890873

In [459]:
tDFs.unstack(level=['week','day'])

week         w1                    w2
day          d1         d3         d1         d2         d3
v1     1.000000   2.000000   3.000000   4.000000   5.000000
v2    10.000000  20.000000  30.000000  40.000000  60.000000
mean   5.500000  11.000000  16.500000  22.000000  32.500000
std    6.363961  12.727922  19.091883  25.455844  38.890873

In [460]:
tDFs.unstack(level=[2,'day'])

,v1,v2,mean,std,v1,v2,mean,std,v1,v2,mean,std
day,d1,d1,d1,d1,d3,d3,d3,d3,d2,d2,d2,d2
week,,,,,,,,,,,,
w1,1.0,10.0,5.5,6.363961,2.0,20.0,11.0,12.727922,NaN,NaN,NaN,NaN
w2,3.0,30.0,16.5,19.091883,5.0,60.0,32.5,38.890873,4.0,40.0,22.0,25.455844

In [461]:
tDFs.unstack(level=[2,'day'])[['mean','std']]

      mean                    std
day     d1    d3    d2         d1         d3         d2
week
w1     5.5  11.0   NaN   6.363961  12.727922        NaN
w2    16.5  32.5  22.0  19.091883  38.890873  25.455844